"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

from uuid import uuid4
import hashlib

pas1 = input("Введите пароль: ")
print ("Ваш пароль: ", pas1)
salt = uuid4().hex
print ("Соль пароля: ", salt)
res1 = hashlib.sha256(salt.encode() + pas1.encode()).hexdigest()
print("Хэш пароля: ", res1)

pas2 = input("Введите пароль еще раз для проверки: ")
print ("Ваш пароль: ", pas2)
print ("Соль пароля: ", salt)
res2 = hashlib.sha256(salt.encode() + pas2.encode()).hexdigest()
print("Хэш пароля: ", res2)

if (res1 == res2):
    print("Вы ввели правильный пароль.")
else:
    print("Вы ввели неверный пароль! Попробуйте еще раз.")